{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "cancel_appointment",
    "1": "view_appointments",
    "2": "list_barbers",
    "3": "list_services",
    "4": "small_talk",
    "5": "book_appointment"
  },
  "initializer_range": 0.02,
  "label2id": {
    "book_appointment": 5,
    "cancel_appointment": 0,
    "list_barbers": 2,
    "list_services": 3,
    "small_talk": 4,
    "view_appointments": 1
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.2",
  "vocab_size": 30522
}
